from collections import Counter

c = Counter('这是一个测试的字符串，测试详情请查看打印。')
print(
    c)  # Counter({'测': 2, '试': 2, '这': 1, '是': 1, '一': 1, '个': 1, '的': 1, '字': 1, '符': 1, '串': 1,
# '，': 1, '详': 1, '情': 1, '请': 1, '查': 1, '看': 1, '打': 1, '印': 1, '。': 1})

print(c.most_common(3))  # [('测', 2), ('试', 2), ('这', 1)]
print(
    c.keys())  # dict_keys(['这', '是', '一', '个', '测', '试', '的', '字', '符', '串', '，', '详', '情', '请', '查', '看', '打', '印', '。'])

print(c.values())  # dict_values([1, 1, 1, 1, 2, 2, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1])

c.update('测试结果！')
